# PANDAS 15 Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

## Cek Versi

In [5]:
import pandas as pd

print(pd.__version__)

1.2.3

## Persiapan Data Frame

In [6]:
data = {
    'nama': ['Albertus Alan', 'Christopher Steven', 'Markvinson Avatara'],
    'tempat_kelahiran':
    ['Sukabumi, Jawa Barat', 'Jakarta, DKI Jakarta', 'Bandung, Jawa Barat']
}
df = pd.DataFrame(data)
df

                 nama      tempat_kelahiran
0       Albertus Alan  Sukabumi, Jawa Barat
1  Christopher Steven  Jakarta, DKI Jakarta
2  Markvinson Avatara   Bandung, Jawa Barat

## Memecah nama depan dan nama belakang

In [7]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

                 nama      tempat_kelahiran   nama_depan nama_belakang
0       Albertus Alan  Sukabumi, Jawa Barat     Albertus          Alan
1  Christopher Steven  Jakarta, DKI Jakarta  Christopher        Steven
2  Markvinson Avatara   Bandung, Jawa Barat   Markvinson       Avatara

## Memecah nama kota dan propinsi

In [4]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Albertus Alan,"Sukabumi, Jawa TBarat",Albertus,Alan,Sukabumi,Jawa TBarat
1,Christopher Steven,"Jakarta, DKI Jakarta",Christopher,Steven,Jakarta,DKI Jakarta
2,Markvinson Avatara,"Bandung, Jawa Barat",Markvinson,Avatara,Bandung,Jawa Barat